<?php

namespace Test;

use DJEM\Typograph\Typograph;

class QuotesTest extends \PHPUnit_Framework_TestCase
{
    public function testQuotes()
    {
        $values = preg_split('/\r?\n/', $this->text);
        do {
            do {
                $first = array_shift($values);
            } while (empty($first));
            $second = array_shift($values);

            $this->assertEquals($second, Typograph::parse($first));
        } while (!empty($values));
    }

    private $text = <<<EOF
Сегодня будет создан
Сегодня будет создан

закон "Сегодня охране".
закон &laquo;Сегодня охране&raquo;.

Сегодня охране охране "сочетание". охране охране
Сегодня охране охране &laquo;сочетание&raquo;. охране охране

охране охране.
охране охране.

сочетание "кавычек"
сочетание &laquo;кавычек&raquo;

Сегодня "English сочетание".
Сегодня &laquo;English сочетание&raquo;.

Сегодня "English сочетание"?
Сегодня &laquo;English сочетание&raquo;?

сочетание "сочетание сочетание" doubleсочетание
сочетание &laquo;сочетание сочетание&raquo; doubleсочетание

сочетание "сочетание сочетание"
сочетание &laquo;сочетание сочетание&raquo;

"сочетание сочетание!"
&laquo;сочетание сочетание!&raquo;

"сочетание сочетание?"
&laquo;сочетание сочетание?&raquo;

"сочетание сочетание."
&laquo;сочетание сочетание.&raquo;

сочетание "сочетание сочетание!"
сочетание &laquo;сочетание сочетание!&raquo;

сочетание "сочетание сочетание?"
сочетание &laquo;сочетание сочетание?&raquo;

сочетание "сочетание сочетание."
сочетание &laquo;сочетание сочетание.&raquo;

сочетание "сочетание сочетание!" сочетание
сочетание &laquo;сочетание сочетание!&raquo; сочетание

сочетание "сочетание сочетание?" 1728371892378912
сочетание &laquo;сочетание сочетание?&raquo; 1728371892378912

сочетание "сочетание сочетание." 2390924092394
сочетание &laquo;сочетание сочетание.&raquo; 2390924092394

"сочетание сочетание!" сочетание
&laquo;сочетание сочетание!&raquo; сочетание

"сочетание сочетание?" 1728371892378912
&laquo;сочетание сочетание?&raquo; 1728371892378912

"сочетание сочетание." 2390924092394
&laquo;сочетание сочетание.&raquo; 2390924092394

сочетание "сочетание" сочетание
сочетание &laquo;сочетание&raquo; сочетание

"сочетание" сочетание сочетание
&laquo;сочетание&raquo; сочетание сочетание

сочетание сочетание "сочетание"
сочетание сочетание &laquo;сочетание&raquo;

сочетание "сочетание сочетание" сочетание
сочетание &laquo;сочетание сочетание&raquo; сочетание

"сочетание сочетание" сочетание сочетание
&laquo;сочетание сочетание&raquo; сочетание сочетание

сочетание сочетание "сочетание сочетание"
сочетание сочетание &laquo;сочетание сочетание&raquo;

"Европа-Азия"
&laquo;Европа-Азия&raquo;

"номер ICQшечки #"
&laquo;номер ICQшечки #&raquo;

"wwwwwwwww:\wwwwwwwww\sitessites\"
&laquo;wwwwwwwww:\wwwwwwwww\sitessites\&raquo;

"Справка 09"
&laquo;Справка 09&raquo;

"данные:"
&laquo;данные:&raquo;

"новый тариф*"
&laquo;новый тариф*&raquo;

"StarFlyerInc."
&laquo;StarFlyerInc.&raquo;

"слово", слово
&laquo;слово&raquo;, слово

слово, "слово"
слово, &laquo;слово&raquo;

Ответь. "блабла" варррры. Блайцу "ввв"
Ответь. &laquo;блабла&raquo; варррры. Блайцу &laquo;ввв&raquo;

"Приветствуем Вас"
&laquo;Приветствуем Вас&raquo;

добавила: "самый любимый "эсмеральда"".
добавила: &laquo;самый любимый &bdquo;эсмеральда&ldquo;&raquo;.

"Фирма "Терминал", "ОблСнаб"
&laquo;Фирма &bdquo;Терминал&ldquo;, &bdquo;ОблСнаб&ldquo;

рассказы "Сердце", "Эвакуация", "Майский сочетание".
рассказы &laquo;Сердце&raquo;, &laquo;Эвакуация&raquo;, &laquo;Майский сочетание&raquo;.

абырвалг: "АААААААБ ЫЫЫРРР "ээээ" алгоритм!" фывфыв
абырвалг: &laquo;АААААААБ ЫЫЫРРР &bdquo;ээээ&ldquo; алгоритм!&raquo; фывфыв

"сочетание "сочетание" сочетание"
&laquo;сочетание &bdquo;сочетание&ldquo; сочетание&raquo;

("слово")
(&laquo;слово&raquo;)

<div>asd</div><div>"test"</div>asd
<div>asd</div><div>&laquo;test&raquo;</div>asd

Неконвертируются &quot;алгоритм&quot; кавычки велочки, адолжны.
Неконвертируются &laquo;алгоритм&raquo; кавычки велочки, адолжны.

Неконвертируются &laquo;всякие&laquo; кавычки
Неконвертируются &laquo;всякие&raquo; кавычки

&laquo;&laquo;кавычки&raquo;&raquo;
&laquo;&bdquo;кавычки&ldquo;&raquo;

"слово "слово"!"
&laquo;слово &bdquo;слово&ldquo;!&raquo;

<b>"слово"</b> <b>"слово"</b>
<b>&laquo;слово&raquo;</b> <b>&laquo;слово&raquo;</b>

&bdquo;Клиника ФГУалгоритм &laquo;КРЭП&raquo; согласно Лицензии&ldquo;
&laquo;Клиника ФГУалгоритм &bdquo;КРЭП&ldquo; согласно Лицензии&raquo;
EOF;
}
